{"config": {"output_layers": [["dense_3", 0, 0]], "name": "model_1", "layers": [{"name": "input_2", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 34], "name": "input_2"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "input_1", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 4096], "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "embedding_1", "config": {"name": "embedding_1", "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "input_length": null, "activity_regularizer": null, "mask_zero": true, "batch_input_shape": [null, null], "dtype": "int32", "embeddings_regularizer": null, "trainable": true, "input_dim": 7579, "embeddings_constraint": null, "output_dim": 256}, "class_name": "Embedding", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "dropout_1", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dropout_2", "config": {"name": "dropout_2", "rate": 0.5, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "dense_1", "config": {"bias_constraint": null, "name": "dense_1", "activity_regularizer": null, "bias_regularizer": null, "units": 256, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "relu", "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "lstm_1", "config": {"recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_1", "go_backwards": false, "units": 256, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_constraint": null, "recurrent_regularizer": null, "bias_regularizer": null, "dropout": 0.0, "return_sequences": false, "activity_regularizer": null, "activation": "tanh", "implementation": 0, "trainable": true, "kernel_regularizer": null, "recurrent_constraint": null}, "class_name": "LSTM", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "add_1", "config": {"name": "add_1", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["dense_1", 0, 0, {}], ["lstm_1", 0, 0, {}]]]}, {"name": "dense_2", "config": {"bias_constraint": null, "name": "dense_2", "activity_regularizer": null, "bias_regularizer": null, "units": 256, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "relu", "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "dense_3", "config": {"bias_constraint": null, "name": "dense_3", "activity_regularizer": null, "bias_regularizer": null, "units": 7579, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "softmax", "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}, "keras_version": "2.0.2", "class_name": "Model", "backend": "tensorflow"}